//======================Copyright (c)=====================================
// 文件名称: BSP_Flash.h
// 功能描述:
//
// 修改记录:
//           2015-01-23, PiaoHong 创建文件
//
//
//========================================================================

#ifndef _BSP_FLASH_H
#define _BSP_FLASH_H

//= Start ================================================================
#include "config.h"
#include "type.h"

//--------------------------------------------------------------
// 函数名称: BSP_Flash_ReadPage
// 功能描述: FLASH 页读
// 输入参数: 地址
// 返回参数: 无
// 修改记录:
//           2015-01-23, PiaoHong 创建函数
//---------------------------------------------------------------
extern void BSP_Flash_ReadPage(UNS32 aAdd);

//--------------------------------------------------------------
// 函数名称: BSP_Flash_WritePage
// 功能描述: FLASH 页写
// 输入参数: 地址
// 返回参数: 无
// 修改记录:
//           2015-01-23, PiaoHong 创建函数
//---------------------------------------------------------------
extern void BSP_Flash_WritePage(UNS32 aAdd);


//--------------------------------------------------------------
// 函数名称: BSP_Flash_WriteWordFormBuf
// 功能描述: 通过页缓存写FLASH一字函数
// 输入参数: 无
// 返回参数: 无
// 修改记录:
//           2015-01-23, PiaoHong 创建函数
//---------------------------------------------------------------
extern void BSP_Flash_WriteWordFormBuf(UNS32 aData,UNS32 aAdd);

//= end   ================================================================

#endif //_BSP_FLASH_H

