//======================Copyright (c)=====================================
// 文件名称: BSP_SysTick.H
// 功能描述:
//
// 修改记录:
//           2014-11-22, PiaoHong 创建文件
//
//
//========================================================================

#ifndef _BSP_SYSTICK_H
#define _BSP_SYSTICK_H


//= Start ================================================================
#include "config.h"
#include "type.h"


#define SYSTICK_OVER    1000000

//--------------------------------------------------------------
// 函数名称: BSP_SysTick_Init
// 功能描述: 启动系统滴答定时器超时
// 输入参数: 无
// 返回参数: 超时 true
// 修改记录:
//           2014-11-21, PiaoHong 创建函数
//---------------------------------------------------------------
extern UNS8 BSP_SysTick_OverTime(UNS16 ms);
extern void BSP_SysTick_OverTime_Reset(void);
//--------------------------------------------------------------
// 函数名称: BSP_SysTick_Init
// 功能描述: 启动系统滴答定时器
// 输入参数: 无
// 返回参数: 无
// 修改记录:
//           2014-11-21, PiaoHong 创建函数
//---------------------------------------------------------------
extern void BSP_SysTick_Init(void);

//= end   ================================================================

#endif //_BSP_SYSTICK_H


