//======================Copyright (c)=====================================
// 文件名称: Lib_Global.C
// 功能描述:
//
// 修改记录:
//           2014-12-23, PiaoHong 创建文件
//
//
//========================================================================
#include "Lib_UserGlobal.h"

//= Start ================================================================


//--------------------------------------------------------------
// 函数名称: abs16
// 功能描述: 返回两个值之间的绝对差值
// 输入参数: 无
// 返回参数: 无
// 修改记录:
//           2014-04-09, PiaoHong 创建函数
//---------------------------------------------------------------
UNS16 abs16(INT16 v1,INT16 v2)
{
    INT32 v = v1;
    v -= v2;
    if(v<0) v=0-v;
//    if(v>30000)v=30000;
    return(v);
}

//--------------------------------------------------------------
// 函数名称: abs32
// 功能描述: 返回两个值之间的绝对差值
// 输入参数: 无
// 返回参数: 无
// 修改记录:
//           2014-04-09, PiaoHong 创建函数
//---------------------------------------------------------------
UNS32 abs32(INT32 v1,INT32 v2)
{
    INT32 v = v1;
    v -= v2;
    if(v<0) v=0-v;
    return(v);
}


//--------------------------------------------------------------
// 函数名称: GetChkSum
// 功能描述: 得到数组的检验和
// 输入参数: UNS8 *Datas 数据指针 UNS8 const DataCnt 数据长度
// 返回参数: 检验和
// 修改记录:
//           2009-11-18, PiaoHong 创建函数
//---------------------------------------------------------------
UNS16 GetChkSum(UNS8 *Datas, UNS16  DataCnt)
{
    UNS16 Sum = 0;
    UNS16 i;

    for (i = 0;i < DataCnt;i++)
    {
        Sum += Datas[i];             //累计值
    }

    return(Sum);
}

//--------------------------------------------------------------
// 函数名称: MemCopy
// 功能描述: 内存复制
// 输入参数: 源指针 目标指针
// 返回参数: 无
// 修改记录:
//           2016-03-10, PiaoHong 创建函数
//---------------------------------------------------------------
void MemCopy(UNS8 *s,UNS8 *d,UNS16 len)
{
    while(len--)
    {
        *d++ = *s++;
    }
}

//--------------------------------------------------------------
// 函数名称: MemCompare
// 功能描述: 内存比较
// 输入参数: 源指针 目标指针
// 返回参数: 一致 true
// 修改记录:
//           2016-03-10, PiaoHong 创建函数
//---------------------------------------------------------------
UNS8 MemCompare(UNS8 *s,UNS8 *d,UNS16 len)
{
    while(len--)
    {
        if(*s++ != *d++)
            return false;
    }

    return true;
}
//= end   ================================================================


