//======================Copyright (c)=====================================
// 文件名称: Lib_Global.H
// 功能描述:
//
// 修改记录:
//           2014-12-23, PiaoHong 创建文件
//
//
//========================================================================

#ifndef _LIB_USER_GLOBAL_H_
#define _LIB_USER_GLOBAL_H_

//= Start ================================================================
#include "type.h"
//--------------------------------------------------------------
// 函数名称: abs16
// 功能描述: 返回两个值之间的绝对差值
// 输入参数: 无
// 返回参数: 无
// 修改记录:
//           2014-04-09, PiaoHong 创建函数
//---------------------------------------------------------------
UNS16 abs16(INT16 v1,INT16 v2);


//--------------------------------------------------------------
// 函数名称: abs32
// 功能描述: 返回两个值之间的绝对差值
// 输入参数: 无
// 返回参数: 无
// 修改记录:
//           2014-04-09, PiaoHong 创建函数
//---------------------------------------------------------------
UNS32 abs32(INT32 v1,INT32 v2);


//--------------------------------------------------------------
// 函数名称: GetChkSum
// 功能描述: 得到数组的检验和
// 输入参数: UNS8 *Datas 数据指针 UNS8 const DataCnt 数据长度
// 返回参数: 检验和
// 修改记录:
//           2009-11-18, PiaoHong 创建函数
//---------------------------------------------------------------
UNS16 GetChkSum(UNS8 *Datas, UNS16  DataCnt);

//--------------------------------------------------------------
// 函数名称: MemCopy
// 功能描述: 内存复制
// 输入参数: 源指针 目标指针
// 返回参数: 无
// 修改记录:
//           2016-03-10, PiaoHong 创建函数
//---------------------------------------------------------------
void MemCopy(UNS8 *s,UNS8 *d,UNS16 len);

//--------------------------------------------------------------
// 函数名称: MemCompare
// 功能描述: 内存比较
// 输入参数: 源指针 目标指针
// 返回参数: 一致 true
// 修改记录:
//           2016-03-10, PiaoHong 创建函数
//---------------------------------------------------------------
UNS8 MemCompare(UNS8 *s,UNS8 *d,UNS16 len);

//= end   ================================================================

#endif //_LIB_GLOBAL_H

